export default {

  // 电话号码
  tel: /^1[3|4|5|7|8][0-9]\d{8}$/,
  // 邮箱
  email: /^[a-zA-Z0-9_.-]+@[a-zA-Z0-9-]+(\.[a-zA-Z0-9-]+)*\.[a-zA-Z0-9]{2,6}$/,
  // 身份证
  certificate: /^\d{6}(18|19|20)?\d{2}(0[1-9]|1[012])(0[1-9]|[12]\d|3[01])\d{3}(\d|[xX])$/,
  // 银行卡
  checkBankCard: /^\d{15}|\d{20}$/,
  // 区号
  areaCode: /^0\d{2,3}$/,
  // 只能输入数字
  mustnum: /^\d+$/,
  // 验证码
  securityCode: /^\d{6}$/,
  // 邮政编码
  zipCode: /^\d{6}$/,
  // 密码
  psw: /^(\w){6,20}$/,
  // 固定电话 或 手机号
  telOrPhone: /^(0[0-9]{2,3}\-)?([2-9][0-9]{6,7})+(\-[0-9]{1,4})?$/,
  // 中文
  zhCN: /^[\u4e00-\u9fa5]+$/,
  // 最多输入20个字符(类型包括字母/数字/汉字)
  symbolfont20: /^[A-Za-z0-9\u4e00-\u9fa5]{0,20}$/,
  // 用户名
  userName: /^[a-zA-Z]\\w{5,17}$/,
  // 密码
  passWord: /^[a-zA-Z0-9]{6,16}$/
}
